app/controllers/admin/products_controller.rb

INSERT INTO "products" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Aeron"], ["description", ""], ["created_at", 2017-02-11 08:56:45 UTC], ["updated_at", 2017-02-11 08:56:45 UTC]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "title" = ?, "description" = ?, "price" = ?, "image" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "MacBook Air"], ["description", "能力胜任大小事，电力满足一天所需。"], ["price", 6988], ["image", "dianano.jpg"], ["updated_at", 2017-02-12 07:17:54 UTC], ["id", 1]]
---
  def update
    @product = Product.find(params[:id])
    if @product.update(product_params)