app/views/carts/index.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 2]]
---

        <% current_cart.cart_items.each do |cart_item| %>

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
              <%= link_to product_path(cart_item.product) do %>
                <% if cart_item.product.image.present? %>

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ? AND "cart_items"."product_id" = ? LIMIT ?  [["cart_id", 2], ["product_id", 2], ["LIMIT", 1]]
---
            <td>
              <% cart_item = current_cart.cart_items.find_by(product_id: cart_item.product_id) %>