app/controllers/orders_controller.rb

  def create
    @order = Order.new(order_params)
    @order.user = current_user
    @order.total = current_cart.total_price

    if @order.save
      current_cart.cart_items.each do |cart_item|
        product_list = ProductList.new
        product_list.order = @order
        product_list.product_name = cart_item.product.title
        product_list.product_price = cart_item.product.price
        product_list.quantity = cart_item.quantity
        product_list.save
---
INSERT INTO "orders" ("total", "user_id", "billing_name", "billing_address", "shipping_name", "shipping_address", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = ?  [["cart_id", 2]]
SELECT "product_lists".* FROM "product_lists" WHERE "product_lists"."order_id" = ?  [["order_id", 11]]
INSERT INTO "product_lists" ("order_id", "product_name", "product_price", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 2], ["product_name", "iphone7"], ["product_price", 7899], ["quantity", 1], ["created_at", 2017-02-12 13:55:44 UTC], ["updated_at", 2017-02-12 13:55:44 UTC]]

  def show
    @order = Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "725e738b-4f58-4d5b-b085-f757b2b38fe2"], ["LIMIT", 1]]

  def pay_with_alipay
    @order = Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "5bb2aad7-b8bf-4ed6-ab34-6b7a4c96080e"], ["LIMIT", 1]]

  def pay_with_wechat
    @order = Order.find_by_token(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."token" = ? LIMIT ?  [["token", "5bb2aad7-b8bf-4ed6-ab34-6b7a4c96080e"], ["LIMIT", 1]]

  def apply_to_cancel
    @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]